Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::v1::VentilationPort Class Referencefinal
MEP Element Manager
The VentilationPort represents a connection point of a duct. More...
#include <MEPVentilationPort.hpp>
 Inheritance diagram for ACAPI::MEP::v1::VentilationPort:
 Public Member Functions
double  | GetWallThickness () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetWallThickness (double thickness)
Sets the thickness of the port's wall.
 Public Member Functions inherited from ACAPI::MEP::v1::PortBase
bool  | Exists () const
GS::UniString  | GetName () const
Orientation  | GetOrientation () const
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
API_Coord3D  | GetPosition () const
Domain  | GetDomain () const
API_AttributeIndex  | GetMEPSystem () const
std::optional< UniqueID >  | GetConnectedPortId () const
std::optional< UniqueID >  | GetConnectedMEPElementId () const
UniqueID  | GetMEPElementId () const
bool  | IsConnected () const
Result< bool >  | IsConnectable (const UniqueID &portId) const
Checks if the Port is connectable to another Port which has the UniqueID of the parameter.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetWidth (double width)
Sets the width of the port.
void  | SetHeight (double height)
Sets the height of the port.
void  | SetShape (ConnectorShape shape)
Sets the shape of the port.
void  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of a Port.
 Static Public Member Functions
static Result< VentilationPort >  | Get (const UniqueID &uniqueId)
Returns a VentilationPort.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::PortBase
PortBase (std::shared_ptr< Impl::IPortBaseImpl >)
Modifier (PortBase &)
Detailed Description
The VentilationPort represents a connection point of a duct.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at PortBase
Member Function Documentation
◆ Get()
 static Result< VentilationPort > ACAPI::MEP::v1::VentilationPort::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a VentilationPort.
Parameters
uniqueId | The UniqueID of the requested VentilationPort.
Returns
If the uniqueId belongs to a VentilationPort, returns the object associated to it, otherwise Error.
◆ GetWallThickness()
 double ACAPI::MEP::v1::VentilationPort::GetWallThickness  |  ( |   | ) |   const
Returns
Returns the wall thickness of the VentilationPort.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::VentilationPort::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetWallThickness()
 void ACAPI::MEP::v1::VentilationPort::SetWallThickness  |  ( |  double  |  thickness | )
Sets the thickness of the port's wall.
Parameters
thickness | The value to be set.